# Build dependencies
brew 'cmake'
brew 'pkg-config'

brew 'assimp'
brew 'bullet'
brew 'eigen'
brew 'fcl'
brew 'fmt'
brew 'flann'
brew 'ipopt'
brew 'libccd'
brew 'nlopt'
brew 'octomap'
brew 'ode'
brew 'opencl-headers'
brew 'opencl-clhpp-headers'
#brew 'open-scene-graph'  # disabled until 3.7.0 is released
brew 'pagmo'
brew 'spdlog'
brew 'tinyxml2'
brew 'urdfdom'
brew 'yaml-cpp'

# dartpy dependencies
brew 'python3'
brew 'pybind11'
